; domain
; ----------------------------------------------------------------------------------------------------------------

; pb 3.2 (extension of pb 3.1) [SOLUTION WITH FLUENTS]

; ----------------------------------------------------------------------------------------------------------------



(define (domain injured-people-scenario)

(:requirements :strips :typing :negative-preconditions :equality :disjunctive-preconditions :fluents)

(:types 

    person - object
    
    place - object
    location warehouse - place ; warehouse is used to def the depot as a constant 
                               ; (since all the cretes are located at the depot in all problem instances)
    robot - object
    crate - object
    medicine food - crate 

    carrier - object ; added separate type for carrier

)

(:constants 
   
    agent - robot  ; we use a separate type for robotic agents, which currently happens to have a single member in all problem instances.
    
    depot - warehouse ; in each problem the crates are positioned at the depot -> each problem must have a depot where crates are stored, so its a constant
)

(:predicates 

    ; localzation of robots, people, crates and carriers
    (robot_at ?r - robot ?pl - place)
    (person_at ?p - person ?pl - place)
    (crate_at ?c - crate ?pl - place)
    (carrier_at ?k - carrier ?pl - place) ; supposed robot and carrier move together (the robot is the one controlling the carrier)

    (has_crate ?p - person ?c - crate)
    (carrying ?k - carrier ?c - crate) ; carrier k is holding crate c

)

(:functions

    (num_crates_carrier ?k - carrier) ; keep track of how many crates the carrier k is holding (max 4)
   
)


; pick up a single crate and load it on the robotic agent, if it is at the same location as the crate
; note: all the crates are located at the depot (warehouse) -> r, c, k must all be at the same loc wh
(:action load
    :parameters (?r - robot ?c - crate ?k - carrier ?wh - warehouse)
    :precondition (and (crate_at ?c ?wh) (robot_at ?r ?wh) (carrier_at ?k ?wh) (not (carrying ?k ?c)) 
                   (< (num_crates_carrier ?k) 4) ) ; check if #crates < capacity -> possible to load crate
    :effect (and (carrying ?k ?c) (not (crate_at ?c ?wh)) (increase (num_crates_carrier ?k) 1))
)

; deliver a crate to a specific person who is at the same location (generic location l)
(:action unload
    :parameters (?r - robot ?c - crate ?p - person ?l - location ?k - carrier)
    :precondition (and (carrying ?k ?c) (robot_at ?r ?l) (carrier_at ?k ?l) (person_at ?p ?l) (> (num_crates_carrier ?k) 0)) ; if #crates > 0 
    :effect (and (has_crate ?p ?c) (not (carrying ?k ?c)) (decrease (num_crates_carrier ?k) 1))
)

;move to another location moving the loaded crate;
; it may also start from the depot at the beginning -> so it starts from a place (more generic, includes bot loc and wh) and arrives at a certain location dst
(:action move_to_deliver
    :parameters (?r - robot ?k - carrier ?src - place ?dst - location) ; place because it may start from the depot
    :precondition (and (robot_at ?r ?src) (carrier_at ?k ?src) (not (= ?src ?dst)) )
    :effect (and (not (robot_at ?r ?src)) (not (carrier_at ?k ?src) ) (robot_at ?r ?dst) (carrier_at ?k ?dst))
)


; carrier moves back to depot when num_crates = 0 (empty), strating from a certain location
; need to def depot as a specific location -> modelled as a const of type warehouse 
; so it'll be possible to extend the problem with other warehouse if needed
(:action move_to_depot
    :parameters (?r - robot ?k - carrier ?src - location ?dst - warehouse)
    :precondition (and (robot_at ?r ?src) (carrier_at ?k ?src) (= (num_crates_carrier ?k) 0)) ; if #crates = 0 go back to depot
    :effect (and (not (robot_at ?r ?src)) (not (carrier_at ?k ?src)) (robot_at ?r ?dst) (carrier_at ?k ?dst))
)


)

; problem
(define (problem problem_two) (:domain injured-people-scenario)
(:objects 
    
    l0 l1 l2 l3 - location
    alice bob mary dave - person

    m0 m1 m2 m3 - medicine
    f0 f1 f2 f3 - food

    carr0 - carrier
)

(:init

    (person_at alice l0)
    (person_at bob l1)
    (person_at mary l3)
    (person_at dave l2)

    (crate_at f0 depot) (crate_at f1 depot) (crate_at f2 depot) (crate_at f3 depot)
    (crate_at m0 depot) (crate_at m1 depot) (crate_at m2 depot) (crate_at m3 depot)

    (robot_at agent depot)
    (carrier_at carr0 depot)

    (= (num_crates_carrier carr0) 0) ; at the beginning carr0 has 0 crates (closed world assumption)
)

(:goal (and
    
    ;Alice wants only food
    (or (has_crate alice f0) (has_crate alice f1) (has_crate alice f2) (has_crate alice f3))

    ; bob wants only medicine
    (or (has_crate bob m0) (has_crate bob m1) (has_crate bob m2) (has_crate bob m3))

    ; mary wants food and medicine
    (or (has_crate mary f0) (has_crate mary f1) (has_crate mary f2) (has_crate mary f3))
    (or (has_crate mary m0) (has_crate mary m1) (has_crate mary m2) (has_crate mary m3))

    ; dave doesn't want neither food or medicine
    (not (or (has_crate dave f0) (has_crate dave f1) (has_crate dave f2) (has_crate dave f3)))
    (not (or (has_crate dave m0) (has_crate dave m1) (has_crate dave m2) (has_crate dave m3)))

    ; -----------------------------------------------
    ; additional goal: make robot (and carrier) go back to depot for new delivery
    (robot_at agent depot)
    (carrier_at carr0 depot)

    ;; ------------------------------------------------------------------------
    ;; alternative solution using existential quantifiers

    ;; Alice only needs food
    ;(exists (?cf - food) (has_crate alice ?cf)) 

    ;; bob only needs medicine
    ;(exists (?cm - medicine) (has_crate bob ?cm))

    ;; mary needs both food and medicine
    ;(exists (?cf - food) (has_crate mary ?cf))
    ;(exists (?cm - medicine) (has_crate mary ?cm))
    
    ;; dave doesn't need food or medicine
    ;(not (exists (?cf - food) (has_crate dave ?cf)))
    ;(not (exists (?cm - medicine) (has_crate dave ?cm)))
)

)

)

; plan
1. (load agent m0 carr0 depot)
   deleted: (crate_at m0 depot)
   added: (carrying carr0 m0)
   changed: (num_crates_carrier carr0) from 0 to 1
   goals met: 4 of 8
2. (load agent m3 carr0 depot)
   deleted: (crate_at m3 depot)
   added: (carrying carr0 m3)
   changed: (num_crates_carrier carr0) from 1 to 2
   goals met: 4 of 8
3. (load agent f0 carr0 depot)
   deleted: (crate_at f0 depot)
   added: (carrying carr0 f0)
   changed: (num_crates_carrier carr0) from 2 to 3
   goals met: 4 of 8
4. (load agent f3 carr0 depot)
   deleted: (crate_at f3 depot)
   added: (carrying carr0 f3)
   changed: (num_crates_carrier carr0) from 3 to 4
   goals met: 4 of 8
5. (move_to_deliver agent carr0 depot l3)
   deleted: (robot_at agent depot) (carrier_at carr0 depot)
   added: (robot_at agent l3) (carrier_at carr0 l3)
   goals met: 2 of 8
6. (unload agent m0 mary l3 carr0)
   deleted: (carrying carr0 m0)
   added: (has_crate mary m0)
   changed: (num_crates_carrier carr0) from 4 to 3
   goals met: 3 of 8
7. (move_to_deliver agent carr0 l3 l1)
   deleted: (robot_at agent l3) (carrier_at carr0 l3)
   added: (robot_at agent l1) (carrier_at carr0 l1)
   goals met: 3 of 8
8. (unload agent m3 bob l1 carr0)
   deleted: (carrying carr0 m3)
   added: (has_crate bob m3)
   changed: (num_crates_carrier carr0) from 3 to 2
   goals met: 4 of 8
9. (move_to_deliver agent carr0 l1 l3)
   deleted: (robot_at agent l1) (carrier_at carr0 l1)
   added: (robot_at agent l3) (carrier_at carr0 l3)
   goals met: 4 of 8
10. (unload agent f0 mary l3 carr0)
   deleted: (carrying carr0 f0)
   added: (has_crate mary f0)
   changed: (num_crates_carrier carr0) from 2 to 1
   goals met: 5 of 8
11. (move_to_deliver agent carr0 l3 l0)
   deleted: (robot_at agent l3) (carrier_at carr0 l3)
   added: (robot_at agent l0) (carrier_at carr0 l0)
   goals met: 5 of 8
12. (unload agent f3 alice l0 carr0)
   deleted: (carrying carr0 f3)
   added: (has_crate alice f3)
   changed: (num_crates_carrier carr0) from 1 to 0
   goals met: 6 of 8
13. (move_to_depot agent carr0 l0 depot)
   deleted: (robot_at agent l0) (carrier_at carr0 l0)
   added: (robot_at agent depot) (carrier_at carr0 depot)
   goals met: 8 of 8
